In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# crete a Series datastructure
s = pd.Series([1,3,5, np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# create  DataFrame data structure
dates = pd.date_range('20170101', periods=6)
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
# create  DateFrame by passing numpy array
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2017-01-01 -0.923405  0.228177 -0.565353  1.260098
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170
2017-01-05 -2.040559  1.465698  0.387114 -1.398587
2017-01-06  1.011364  0.624963  0.005306 -0.433379

In [7]:
# create DataFrame by using dict
df2 = pd.DataFrame({ 'A': 1.,
                   'B': pd.Timestamp('20170102'),
                   'C': pd.Series(1, index = list(range(4)), dtype='float32'),
                   'D': np.array([3] * 4, dtype = 'int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2017-01-02  1.0  3   test  foo
1  1.0 2017-01-02  1.0  3  train  foo
2  1.0 2017-01-02  1.0  3   test  foo
3  1.0 2017-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
# view data
df.head()

                   A         B         C         D
2017-01-01 -0.923405  0.228177 -0.565353  1.260098
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170
2017-01-05 -2.040559  1.465698  0.387114 -1.398587

In [15]:
#view data
df.tail()

                   A         B         C         D
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170
2017-01-05 -2.040559  1.465698  0.387114 -1.398587
2017-01-06  1.011364  0.624963  0.005306 -0.433379

In [16]:
df.tail(2)

                   A         B         C         D
2017-01-05 -2.040559  1.465698  0.387114 -1.398587
2017-01-06  1.011364  0.624963  0.005306 -0.433379

In [17]:
# display index
df.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
# display column
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [19]:
# display values
df.values

array([[-0.92340543,  0.22817658, -0.56535297,  1.26009798],
       [ 1.18276294, -0.56459893, -0.78135877,  0.62857164],
       [-2.23206723,  1.9438488 ,  2.91954941, -0.36444705],
       [-1.0549836 ,  1.05039485, -0.15362154, -1.55717033],
       [-2.04055911,  1.46569776,  0.38711363, -1.39858678],
       [ 1.01136422,  0.62496287,  0.00530571, -0.43337936]])

In [20]:
# display transposing data
df.T

   2017-01-01  2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06
A   -0.923405    1.182763   -2.232067   -1.054984   -2.040559    1.011364
B    0.228177   -0.564599    1.943849    1.050395    1.465698    0.624963
C   -0.565353   -0.781359    2.919549   -0.153622    0.387114    0.005306
D    1.260098    0.628572   -0.364447   -1.557170   -1.398587   -0.433379

In [25]:
# sort by as axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2017-01-01  1.260098 -0.565353  0.228177 -0.923405
2017-01-02  0.628572 -0.781359 -0.564599  1.182763
2017-01-03 -0.364447  2.919549  1.943849 -2.232067
2017-01-04 -1.557170 -0.153622  1.050395 -1.054984
2017-01-05 -1.398587  0.387114  1.465698 -2.040559
2017-01-06 -0.433379  0.005306  0.624963  1.011364

In [26]:
# sort by values
df.sort_values(by='B')

                   A         B         C         D
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-01 -0.923405  0.228177 -0.565353  1.260098
2017-01-06  1.011364  0.624963  0.005306 -0.433379
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170
2017-01-05 -2.040559  1.465698  0.387114 -1.398587
2017-01-03 -2.232067  1.943849  2.919549 -0.364447

In [27]:
# selection
df['A']

2017-01-01   -0.923405
2017-01-02    1.182763
2017-01-03   -2.232067
2017-01-04   -1.054984
2017-01-05   -2.040559
2017-01-06    1.011364
Freq: D, Name: A, dtype: float64

In [28]:
# selecting via []
df[0:3]

                   A         B         C         D
2017-01-01 -0.923405  0.228177 -0.565353  1.260098
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447

In [29]:
# selecting via []
df['20170102':'20170104']

                   A         B         C         D
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170

In [30]:
#select by label
df.loc[dates[0]]

A   -0.923405
B    0.228177
C   -0.565353
D    1.260098
Name: 2017-01-01 00:00:00, dtype: float64

In [31]:
# select  multi-axis by label
df.loc[:, ['A','B']]

                   A         B
2017-01-01 -0.923405  0.228177
2017-01-02  1.182763 -0.564599
2017-01-03 -2.232067  1.943849
2017-01-04 -1.054984  1.050395
2017-01-05 -2.040559  1.465698
2017-01-06  1.011364  0.624963

In [32]:
# show label slicing both endpoint are included
df.loc['20170102':'20170104', ['A', 'B']]

                   A         B
2017-01-02  1.182763 -0.564599
2017-01-03 -2.232067  1.943849
2017-01-04 -1.054984  1.050395

In [33]:
# getting a scalar value
df.loc[dates[0], 'A']

-0.92340542871465336

In [34]:
# for getting fast assecc to a sclar
df.at[dates[0], 'A']

-0.92340542871465336

###  Select by position

In [35]:
# pass int
df.iloc[3]

A   -1.054984
B    1.050395
C   -0.153622
D   -1.557170
Name: 2017-01-04 00:00:00, dtype: float64

In [36]:
# integer slicing
df.iloc[3:5,0:2]

                   A         B
2017-01-04 -1.054984  1.050395
2017-01-05 -2.040559  1.465698

In [37]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2017-01-02  1.182763 -0.781359
2017-01-03 -2.232067  2.919549
2017-01-05 -2.040559  0.387114

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-03 -2.232067  1.943849  2.919549 -0.364447

In [40]:
# slici columns
df.iloc[:, 1:3]

                   B         C
2017-01-01  0.228177 -0.565353
2017-01-02 -0.564599 -0.781359
2017-01-03  1.943849  2.919549
2017-01-04  1.050395 -0.153622
2017-01-05  1.465698  0.387114
2017-01-06  0.624963  0.005306

In [41]:
# get value
df.iloc[1,1]

-0.56459892960791358

In [42]:
df.iat[1,1]

-0.56459892960791358

In [45]:
# boolean indexing
df[df.A > 0]

                   A         B         C         D
2017-01-02  1.182763 -0.564599 -0.781359  0.628572
2017-01-06  1.011364  0.624963  0.005306 -0.433379

In [48]:
# filter
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2017-01-01 -0.923405  0.228177 -0.565353  1.260098    one
2017-01-02  1.182763 -0.564599 -0.781359  0.628572    one
2017-01-03 -2.232067  1.943849  2.919549 -0.364447    two
2017-01-04 -1.054984  1.050395 -0.153622 -1.557170  three
2017-01-05 -2.040559  1.465698  0.387114 -1.398587   four
2017-01-06  1.011364  0.624963  0.005306 -0.433379  three

In [49]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2017-01-03 -2.232067  1.943849  2.919549 -0.364447   two
2017-01-05 -2.040559  1.465698  0.387114 -1.398587  four

In [50]:
# setting
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20170102', periods=6))
s1

2017-01-02    1
2017-01-03    2
2017-01-04    3
2017-01-05    4
2017-01-06    5
2017-01-07    6
Freq: D, dtype: int64

In [52]:
df['F'] = s1

In [53]:
# set value by label
df.at[dates[0], 'A'] = 0

In [54]:
# set vlaue by posistion
df.iat[0,1] = 0

In [55]:
# assign with numpy array
df.loc[:, 'D'] = np.array([5] * len(df))

In [56]:
df

                   A         B         C  D    F
2017-01-01  0.000000  0.000000 -0.565353  5  NaN
2017-01-02  1.182763 -0.564599 -0.781359  5  1.0
2017-01-03 -2.232067  1.943849  2.919549  5  2.0
2017-01-04 -1.054984  1.050395 -0.153622  5  3.0
2017-01-05 -2.040559  1.465698  0.387114  5  4.0
2017-01-06  1.011364  0.624963  0.005306  5  5.0

In [57]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2017-01-01  0.000000  0.000000 -0.565353 -5  NaN
2017-01-02 -1.182763 -0.564599 -0.781359 -5 -1.0
2017-01-03 -2.232067 -1.943849 -2.919549 -5 -2.0
2017-01-04 -1.054984 -1.050395 -0.153622 -5 -3.0
2017-01-05 -2.040559 -1.465698 -0.387114 -5 -4.0
2017-01-06 -1.011364 -0.624963 -0.005306 -5 -5.0

In [59]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2017-01-01  0.000000  0.000000 -0.565353  5  NaN  1.0
2017-01-02  1.182763 -0.564599 -0.781359  5  1.0  1.0
2017-01-03 -2.232067  1.943849  2.919549  5  2.0  NaN
2017-01-04 -1.054984  1.050395 -0.153622  5  3.0  NaN

In [60]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2017-01-02  1.182763 -0.564599 -0.781359  5  1.0  1.0

In [61]:
# filling the missing data
df1.fillna(value=5)

                   A         B         C  D    F    E
2017-01-01  0.000000  0.000000 -0.565353  5  5.0  1.0
2017-01-02  1.182763 -0.564599 -0.781359  5  1.0  1.0
2017-01-03 -2.232067  1.943849  2.919549  5  2.0  5.0
2017-01-04 -1.054984  1.050395 -0.153622  5  3.0  5.0

In [62]:
# get boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2017-01-01  False  False  False  False   True  False
2017-01-02  False  False  False  False  False  False
2017-01-03  False  False  False  False  False   True
2017-01-04  False  False  False  False  False   True

In [63]:
# operation
df.mean()

A   -0.522247
B    0.753384
C    0.301939
D    5.000000
F    3.000000
dtype: float64

In [64]:
df.mean(1)

2017-01-01    1.108662
2017-01-02    1.167361
2017-01-03    1.926266
2017-01-04    1.568358
2017-01-05    1.762450
2017-01-06    2.328327
Freq: D, dtype: float64

In [65]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2017-01-01    NaN
2017-01-02    NaN
2017-01-03    1.0
2017-01-04    3.0
2017-01-05    5.0
2017-01-06    NaN
Freq: D, dtype: float64

In [66]:
df.sub(s, axis='index')

                   A         B         C    D    F
2017-01-01       NaN       NaN       NaN  NaN  NaN
2017-01-02       NaN       NaN       NaN  NaN  NaN
2017-01-03 -3.232067  0.943849  1.919549  4.0  1.0
2017-01-04 -4.054984 -1.949605 -3.153622  2.0  0.0
2017-01-05 -7.040559 -3.534302 -4.612886  0.0 -1.0
2017-01-06       NaN       NaN       NaN  NaN  NaN

In [67]:
df.apply(np.cumsum)

                   A         B         C   D     F
2017-01-01  0.000000  0.000000 -0.565353   5   NaN
2017-01-02  1.182763 -0.564599 -1.346712  10   1.0
2017-01-03 -1.049304  1.379250  1.572838  15   3.0
2017-01-04 -2.104288  2.429645  1.419216  20   6.0
2017-01-05 -4.144847  3.895342  1.806330  25  10.0
2017-01-06 -3.133483  4.520305  1.811635  30  15.0

In [68]:
s = pd.Series(np.random.randint(0,7, size =10))
s

0    1
1    5
2    1
3    0
4    0
5    1
6    1
7    0
8    3
9    6
dtype: int64

In [70]:
s.value_counts()

1    4
0    3
6    1
5    1
3    1
dtype: int64

In [71]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [72]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [73]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.806342  1.091293  0.074417  0.584782
1 -1.519099 -0.126124  0.150874  0.248270
2  0.792788 -1.198483 -0.266546 -0.274673
3 -1.190107  1.994087  1.115881 -0.027778
4  1.937604  1.651313 -0.466402 -0.132412
5  0.434186 -3.703018  0.939819 -0.522234
6  0.185233  0.603636 -0.316779 -0.534453
7 -0.755981 -1.840729 -0.395712 -0.056635
8  0.710201  0.254374  0.754536 -0.426047
9  1.199626 -0.109899  0.423901 -1.408911

In [74]:
# break it inbto pieces
pieces = [df[:3], df[3:7], df[7:]]

In [75]:
pd.concat(pieces)

          0         1         2         3
0  0.806342  1.091293  0.074417  0.584782
1 -1.519099 -0.126124  0.150874  0.248270
2  0.792788 -1.198483 -0.266546 -0.274673
3 -1.190107  1.994087  1.115881 -0.027778
4  1.937604  1.651313 -0.466402 -0.132412
5  0.434186 -3.703018  0.939819 -0.522234
6  0.185233  0.603636 -0.316779 -0.534453
7 -0.755981 -1.840729 -0.395712 -0.056635
8  0.710201  0.254374  0.754536 -0.426047
9  1.199626 -0.109899  0.423901 -1.408911

In [76]:
# SQL join
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1,2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [4,5]})
left

   key  lval
0  foo     1
1  foo     2

In [77]:
right

   key  lval
0  foo     4
1  foo     5

In [78]:
pd.merge (left,right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [79]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1,2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4,5]})
left

   key  lval
0  foo     1
1  bar     2

In [80]:
right

   key  rval
0  foo     4
1  bar     5

In [81]:
pd.merge(left,right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [82]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C', 'D'])
df

          A         B         C         D
0  0.013698 -0.070566  0.142821  2.281239
1 -1.468902 -1.451196 -0.873148 -0.830366
2  1.078558 -1.520149  0.580463 -0.060144
3 -0.768514 -0.928144  0.242025  0.358053
4  1.171488  0.366004  0.842462  0.171170
5 -0.167019  0.896404 -0.777417  0.766241
6 -0.714924  0.404325 -0.749358  0.373201
7  0.288144 -0.011732  0.338461  1.039696

In [83]:
np.random.randn(8,4)

array([[ 0.27341203, -2.1015363 ,  0.40509746, -0.50251395],
       [ 0.28034474,  1.46662267,  1.06942553,  0.44838776],
       [-2.47065682, -0.07098335,  0.31579675, -1.95875254],
       [ 1.50519363,  0.53734065,  1.47744715,  0.73898776],
       [ 1.04626741,  0.42703208,  0.1485697 ,  0.42016133],
       [-0.08521065, -0.8725025 , -0.2613141 ,  1.68693534],
       [-0.18741304, -0.14417446,  0.39534461, -1.47315541],
       [-0.37545953,  3.77040901,  0.97950953, -0.13446479]])

In [84]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.013698 -0.070566  0.142821  2.281239
1 -1.468902 -1.451196 -0.873148 -0.830366
2  1.078558 -1.520149  0.580463 -0.060144
3 -0.768514 -0.928144  0.242025  0.358053
4  1.171488  0.366004  0.842462  0.171170
5 -0.167019  0.896404 -0.777417  0.766241
6 -0.714924  0.404325 -0.749358  0.373201
7  0.288144 -0.011732  0.338461  1.039696
8 -0.768514 -0.928144  0.242025  0.358053

In [85]:
# Grouping
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.731901  2.287170
1  bar    one  1.763202  0.672226
2  foo    two  0.552988  0.312916
3  bar  three -0.321182  2.368302
4  foo    two -1.232852 -0.901969
5  bar    two -0.531043 -1.034809
6  foo    one  0.225268  0.411701
7  foo  three  1.758519  2.044942

In [87]:
# grouping
df.groupby('A').sum()

            C         D
A
bar  0.910977  2.005720
foo  3.035824  4.154761

In [88]:
# group by milti
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.763202  0.672226
    three -0.321182  2.368302
    two   -0.531043 -1.034809
foo one    1.957169  2.698872
    three  1.758519  2.044942
    two   -0.679864 -0.589053

In [90]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qyx'],
                   ['one', 'two', 'one','two', 'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names= ['first', 'second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.845845 -0.311146
      two     1.483251  0.228711
baz   one     1.609070 -0.378307
      two     0.848235 -0.472589

In [91]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qyx', 'two')]

In [92]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.845845
               B   -0.311146
       two     A    1.483251
               B    0.228711
baz    one     A    1.609070
               B   -0.378307
       two     A    0.848235
               B   -0.472589
dtype: float64

In [94]:
stacked.unstack()

                     A         B
first second
bar   one    -0.845845 -0.311146
      two     1.483251  0.228711
baz   one     1.609070 -0.378307
      two     0.848235 -0.472589

In [95]:
stacked.unstack(1)

second        one       two
first
bar   A -0.845845  1.483251
      B -0.311146  0.228711
baz   A  1.609070  0.848235
      B -0.378307 -0.472589

In [96]:
# Pivot table
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                  'B': ['A', 'B', 'C'] * 4,
                  'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                  'D': np.random.randn(12),
                  'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.125833 -2.497322
1     one  B  foo  1.146760  0.115522
2     two  C  foo -1.343067 -0.801833
3   three  A  bar  0.838421 -0.146970
4     one  B  bar  0.915451 -0.153680
5     one  C  bar -0.966626  1.003115
6     two  A  foo  0.869382 -1.128857
7   three  B  foo -0.165296 -0.539744
8     one  C  foo -0.400900 -0.513391
9     one  A  bar -1.134813  1.374672
10    two  B  bar -0.445262  2.388511
11  three  C  bar  0.838768  0.368633

In [98]:

pd.pivot_table(df, values='D', index=['A', 'B'], columns= ['C'])

C             bar       foo
A     B
one   A -1.134813  0.125833
      B  0.915451  1.146760
      C -0.966626 -0.400900
three A  0.838421       NaN
      B       NaN -0.165296
      C  0.838768       NaN
two   A       NaN  0.869382
      B -0.445262       NaN
      C       NaN -1.343067

In [99]:
# times series
rng = pd.date_range('1/1/2017', periods=100, freq='S')
ts = pd.Series(np.random.randint(0,500, len(rng)), index = rng)
ts.resample('5Min').sum()

2017-01-01    26078
Freq: 5T, dtype: int64

In [100]:
rng

DatetimeIndex(['2017-01-01 00:00:00', '2017-01-01 00:00:01',
               '2017-01-01 00:00:02', '2017-01-01 00:00:03',
               '2017-01-01 00:00:04', '2017-01-01 00:00:05',
               '2017-01-01 00:00:06', '2017-01-01 00:00:07',
               '2017-01-01 00:00:08', '2017-01-01 00:00:09',
               '2017-01-01 00:00:10', '2017-01-01 00:00:11',
               '2017-01-01 00:00:12', '2017-01-01 00:00:13',
               '2017-01-01 00:00:14', '2017-01-01 00:00:15',
               '2017-01-01 00:00:16', '2017-01-01 00:00:17',
               '2017-01-01 00:00:18', '2017-01-01 00:00:19',
               '2017-01-01 00:00:20', '2017-01-01 00:00:21',
               '2017-01-01 00:00:22', '2017-01-01 00:00:23',
               '2017-01-01 00:00:24', '2017-01-01 00:00:25',
               '2017-01-01 00:00:26', '2017-01-01 00:00:27',
               '2017-01-01 00:00:28', '2017-01-01 00:00:29',
               '2017-01-01 00:00:30', '2017-01-01 00:00:31',
               '2017-01-01 00:00:32', '2017-01-01 00:00:33',
               '2017-01-01 00:00:34', '2017-01-01 00:00:35',
               '2017-01-01 00:00:36', '2017-01-01 00:00:37',
               '2017-01-01 00:00:38', '2017-01-01 00:00:39',
               '2017-01-01 00:00:40', '2017-01-01 00:00:41',
               '2017-01-01 00:00:42', '2017-01-01 00:00:43',
               '2017-01-01 00:00:44', '2017-01-01 00:00:45',
               '2017-01-01 00:00:46', '2017-01-01 00:00:47',
               '2017-01-01 00:00:48', '2017-01-01 00:00:49',
               '2017-01-01 00:00:50', '2017-01-01 00:00:51',
               '2017-01-01 00:00:52', '2017-01-01 00:00:53',
               '2017-01-01 00:00:54', '2017-01-01 00:00:55',
               '2017-01-01 00:00:56', '2017-01-01 00:00:57',
               '2017-01-01 00:00:58', '2017-01-01 00:00:59',
               '2017-01-01 00:01:00', '2017-01-01 00:01:01',
               '2017-01-01 00:01:02', '2017-01-01 00:01:03',
               '2017-01-01 00:01:04', '2017-01-01 00:01:05',
               '2017-01-01 00:01:06', '2017-01-01 00:01:07',
               '2017-01-01 00:01:08', '2017-01-01 00:01:09',
               '2017-01-01 00:01:10', '2017-01-01 00:01:11',
               '2017-01-01 00:01:12', '2017-01-01 00:01:13',
               '2017-01-01 00:01:14', '2017-01-01 00:01:15',
               '2017-01-01 00:01:16', '2017-01-01 00:01:17',
               '2017-01-01 00:01:18', '2017-01-01 00:01:19',
               '2017-01-01 00:01:20', '2017-01-01 00:01:21',
               '2017-01-01 00:01:22', '2017-01-01 00:01:23',
               '2017-01-01 00:01:24', '2017-01-01 00:01:25',
               '2017-01-01 00:01:26', '2017-01-01 00:01:27',
               '2017-01-01 00:01:28', '2017-01-01 00:01:29',
               '2017-01-01 00:01:30', '2017-01-01 00:01:31',
               '2017-01-01 00:01:32', '2017-01-01 00:01:33',
               '2017-01-01 00:01:34', '2017-01-01 00:01:35',
               '2017-01-01 00:01:36', '2017-01-01 00:01:37',
               '2017-01-01 00:01:38', '2017-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [101]:
np.random.randint(0,500, len(rng))

array([165, 423, 324, 173,  83, 195, 110, 332,  94, 137, 419,   1, 154,
       142, 372, 379,  91, 165, 188,  64, 246,  72, 398,   7, 310, 171,
        10,  58, 185, 130, 193, 286, 264,  20, 430, 448, 475, 294, 168,
       128, 180, 394, 493, 265,  18, 250, 267, 428, 143,  10, 398, 202,
       253, 250, 194,  31, 303, 470, 383, 175, 159, 234, 317, 165, 230,
       389, 243,  28, 267,   7, 401, 240,   7, 335, 466, 253, 271, 322,
       458, 438, 223, 346, 312, 269, 498, 433, 303,  73, 490, 122,  68,
       392, 220,  93,  64, 218,  65,  31, 494, 334])

In [103]:
ts.resample('5Min').sum()

2017-01-01    26078
Freq: 5T, dtype: int64

In [104]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [105]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.722154
2012-03-07    1.138749
2012-03-08   -0.578834
2012-03-09    0.206207
2012-03-10    0.875595
Freq: D, dtype: float64

In [109]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    1.722154
2012-03-07 00:00:00+00:00    1.138749
2012-03-08 00:00:00+00:00   -0.578834
2012-03-09 00:00:00+00:00    0.206207
2012-03-10 00:00:00+00:00    0.875595
Freq: D, dtype: float64

In [111]:

ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.722154
2012-03-06 19:00:00-05:00    1.138749
2012-03-07 19:00:00-05:00   -0.578834
2012-03-08 19:00:00-05:00    0.206207
2012-03-09 19:00:00-05:00    0.875595
Freq: D, dtype: float64

In [112]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
rng

DatetimeIndex(['2012-01-31', '2012-02-29', '2012-03-31', '2012-04-30',
               '2012-05-31'],
              dtype='datetime64[ns]', freq='M')

In [113]:
ts = pd.Series(np.random.randn(len(rng)), index= rng)
ts

2012-01-31   -0.233548
2012-02-29    1.199654
2012-03-31    0.218476
2012-04-30   -0.634660
2012-05-31   -0.774184
Freq: M, dtype: float64

In [114]:
ps = ts.to_period()
ps

2012-01   -0.233548
2012-02    1.199654
2012-03    0.218476
2012-04   -0.634660
2012-05   -0.774184
Freq: M, dtype: float64

In [115]:
ps.to_timestamp()

2012-01-01   -0.233548
2012-02-01    1.199654
2012-03-01    0.218476
2012-04-01   -0.634660
2012-05-01   -0.774184
Freq: MS, dtype: float64

In [116]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [117]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

1990Q1   -0.239865
1990Q2    0.607859
1990Q3   -0.694252
1990Q4    0.101271
1991Q1    0.017936
1991Q2   -0.458095
1991Q3    0.581120
1991Q4   -0.699698
1992Q1   -1.004157
1992Q2    1.402101
1992Q3    0.550167
1992Q4   -0.267534
1993Q1    0.845079
1993Q2   -0.173020
1993Q3    0.034412
1993Q4    0.469553
1994Q1   -0.255010
1994Q2    0.069369
1994Q3   -0.263437
1994Q4   -1.111129
1995Q1   -1.077875
1995Q2   -0.686362
1995Q3    1.093310
1995Q4   -3.240933
1996Q1   -0.087361
1996Q2   -0.065743
1996Q3    2.040702
1996Q4   -0.555627
1997Q1    1.377603
1997Q2   -0.593833
1997Q3    0.479994
1997Q4   -0.249971
1998Q1    0.479249
1998Q2    0.190661
1998Q3    0.767968
1998Q4    0.307831
1999Q1    1.381929
1999Q2    0.801972
1999Q3   -0.444506
1999Q4   -1.228280
2000Q1    1.557198
2000Q2    0.855925
2000Q3   -1.247343
2000Q4    0.441082
Freq: Q-NOV, dtype: float64

In [119]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00   -0.239865
1990-06-01 09:00    0.607859
1990-09-01 09:00   -0.694252
1990-12-01 09:00    0.101271
1991-03-01 09:00    0.017936
Freq: H, dtype: float64

In [121]:
df = pd.DataFrame({"id": [1,2,3,4,5,6], "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [122]:
df["grade"] = df["raw_grade"].astype("category")
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [123]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [124]:
df["grade"].cat.categories = ['very good', 'good', 'very bad']

In [125]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [127]:
df.sort_values(by="grade")

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [130]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64

In [131]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts

2000-01-01    1.548444
2000-01-02   -1.065509
2000-01-03    1.085010
2000-01-04   -0.402505
2000-01-05   -0.756349
2000-01-06   -0.191284
2000-01-07   -1.684813
2000-01-08   -1.232333
2000-01-09    0.293287
2000-01-10    1.031897
2000-01-11   -1.688860
2000-01-12   -0.086830
2000-01-13   -1.684788
2000-01-14    0.978583
2000-01-15    0.464640
2000-01-16    0.976309
2000-01-17   -1.925049
2000-01-18   -1.273073
2000-01-19    0.214563
2000-01-20    1.169334
2000-01-21   -0.253152
2000-01-22   -0.966114
2000-01-23    1.281845
2000-01-24   -1.316968
2000-01-25    1.549430
2000-01-26    0.345838
2000-01-27   -0.247431
2000-01-28   -0.937249
2000-01-29    1.178097
2000-01-30   -0.194826
                ...
2002-08-28    0.062309
2002-08-29    0.936147
2002-08-30   -0.033762
2002-08-31   -1.219224
2002-09-01   -0.175382
2002-09-02   -1.789137
2002-09-03   -0.556587
2002-09-04   -0.167133
2002-09-05   -0.251497
2002-09-06   -0.110121
2002-09-07    0.248922
2002-09-08   -0.292284
2002-09-09    0.614187
2002-09-10    0.656093
2002-09-11    1.071055
2002-09-12    0.708145
2002-09-13   -0.435754
2002-09-14    0.086789
2002-09-15    1.558431
2002-09-16   -2.019853
2002-09-17    0.578728
2002-09-18    0.787112
2002-09-19    0.188790
2002-09-20   -2.204147
2002-09-21    1.498573
2002-09-22    0.271777
2002-09-23   -1.489767
2002-09-24    0.065605
2002-09-25   -0.723022
2002-09-26    0.808438
Freq: D, dtype: float64

In [132]:
ts = ts.cumsum()
ts.plot()

In [133]:
df = pd.DataFrame(np.random.randn(1000,4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure();df.plot(); plt.legend(loc='best')